#!/bin/bash

#=================================================
# 环境配置示例文件
#=================================================


# =============================================================================
# 环境标识
# =============================================================================
ENV_NAME="dev"
ENV_DESCRIPTION="本地测试环境配置"

# =============================================================================
# 基础环境配置（覆盖base配置）
# =============================================================================
# Datakit版本
DATAKIT_VERSION="${DATAKIT_VERSION:-1.78.0}"

# 运维平台配置
OPS_ADDR="${OPS_ADDR:-http://127.0.0.1:5000}"

# Dataway配置
DATAWAY_URL="${DATAWAY_URL:-https://openway.guance.com?token=tkn_3a0052c9f6d3498c8ce9ca0988fd9c82}"

# =============================================================================
# S3配置
# =============================================================================
S3_REGION="${S3_REGION:-ap-southeast-1}"
S3_ENDPOINT="${S3_ENDPOINT:-https://s3.ap-southeast-1.amazonaws.com}"
S3_ACCESS_KEY="${S3_ACCESS_KEY:-xxxxxx}"
S3_SECRET_KEY="AWS_SECRET_ACCESS_KEY_PLACEHOLDER"
S3_BUCKET="${S3_BUCKET:-benjamin--test}"
S3_DATAKIT_DIR="${S3_DATAKIT_DIR:-datakit}"



# =============================================================================
# 自定义配置
# =============================================================================
